<template>
    <div class="body">
        <div class="app-container">
            <div style="float: right;padding-right: 50px;color: #fff;padding-top: 20px;line-height: 12px;">
                客服电话：010-0123456789
                <el-button @click="goLogin()" round>登录</el-button>
                <el-button @click="goRegister()" round>注册</el-button>
            </div>
            <div style="font-size: 40px;color: #ffffff;margin-left: 200px;margin-top: 20%;position: absolute;">
               让操作更简单，让生活更美好！
            </div>
            <div style="height: 550px;position: absolute;right: 9%;top: 7%;border-radius:10px;" class="demo-ruleForm login-container">
                <el-form :model="ruleForm2" :rules="rules2" ref="ruleForm2" label-position="left" label-width="0px">
                    <h3 class="title">注册</h3>
                    <el-form-item prop="account">
                        <el-input type="text" v-model="ruleForm2.userName" auto-complete="off" placeholder="账号"></el-input>
                    </el-form-item>
                    <el-form-item prop="email">
                        <el-input type="text" v-model="ruleForm2.email" auto-complete="off" placeholder="邮箱"></el-input>
                    </el-form-item>
                    <el-form-item prop="mobile">
                        <el-input type="text" v-model="ruleForm2.mobile" auto-complete="off" placeholder="手机号"></el-input>
                    </el-form-item>
                    <el-form-item prop="checkPass">
                        <el-input type="password" v-model="ruleForm2.passWord" auto-complete="off" placeholder="密码"></el-input>
                    </el-form-item>
                    <el-form-item>
                        <img alt="验证码" onclick = "this.src='api/defaultKaptcha?d='+new Date()*1" src="api/defaultKaptcha" />
                    </el-form-item>
                    <el-form-item prop="vrifyCode">
                        <el-input type="text" v-model="ruleForm2.vrifyCode" auto-complete="off" placeholder="验证码"></el-input>
                    </el-form-item>
                    <el-checkbox class="remember" v-model="ruleForm2.protocol">
                        注册即表示同意<el-button type="text"  @click="centerDialogVisible = true">注册协议</el-button>
                    </el-checkbox>
                    <el-form-item style="width:100%;">
                        <el-button type="primary" style="width:100%;" @click="handleRegister('ruleForm2')" round>注册</el-button>
                    </el-form-item>
                </el-form>
            </div>
            <div class="footer">
                © 2019 SystemModel 京ICP备16016817号
            </div>

            <el-dialog title="SM网站注册协议"
                :visible.sync="centerDialogVisible"
                width="80%"
                center>
                <div style="overflow-y: auto; overflow-x: hidden; height: 600px;">
                    <h3>尊敬的用户：</h3>
                    <p>
                        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;非常感谢您使用SM网站。<br>
                        SM有限公司（下称“本公司”）依据以下条件和条款，通过“Seedeer全球跨境物流平台”（网址为“[www.seedeer.com]”）
                        （下称“本平台”）向会员提供全球跨境物流服务（下称“本服务”）。
                        会员在使用本服务前，应认真阅读 “SM网站注册协议”（下称“本协议”），充分理解各条款的内容，特别是免除或者限制本公司责任条款。
                        如会员不同意本协议，可以主动取消本平台提供的服务；会员在使用本平台提供的各项服务的同时，应视为会员承诺接受并遵守本协议的全部内容。
                    </p>
                    <h2>
                        一、总则
                    </h2>
                    <p>
                        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;SM平台有权根据需要不时地制定、修改本协议或各类规则。
                        所有规则为协议不可分割的一部分，与协议正文具有同等法律效力。
                        如本协议有任何变更，SM平台将在网站上刊载公告，通知会员。如会员不同意相关变更，必须停止使用本服务。
                        经修订的协议一经在SM平台公布后，立即自动生效。除非规则中有特别说明，所有规则会在发布后立即生效，
                        亦成为本服务协议的一部分。登录或继续使用“本服务”将表示会员接受经修订的协议和当时所有有效的规则。除另行明确声明外，
                        任何使“本服务”范围扩大或功能增强的新内容均受本协议约束。会员在签署本服务协议前，请务必认真阅读全部服务协议内容，
                        如有任何疑问，可向本公司咨询。会员确认本服务协议后，本服务协议即在会员和本公司之间产生法律效力。
                    </p>
                    <h2>二、会员管理和隐私保护</h2>
                    <h3>第一条（会员申请）</h3>
                    <p>
                        1.会员需向本平台提交注册申请，经本公司审核同意后即完成注册手续。会员为未成年人时，需经法定代理人同意后方可申请注册。<br>
                        2.会员应提供及时、详尽及准确的个人资料，并及时更新注册资料。所有原始键入的资料将引用为注册资料。如果因注册信息不真实而引起的问题，以及对于该问题所导致的后果和损失，本平台将不负任何责任。<br>
                        3.如本公司发现会员属于以下任何一项规定，可以拒绝会员的注册申请，即使已批准入会者也可取消其会员资格：<br>
                        1)入会申请人为未成年人，且未经法定代理人同意；<br>
                        2)入会申请人曾经因违反本服务协议或规则等行为而被取消会员资格；<br>
                        3）入会申请人提交的申请中，有虚假、误写或漏写的事项；<br>
                        4）入会申请人有未支付本平台债务的记录；<br>
                        5）妨害本平台的运营和服务或妨害其他会员使用本平台的服务，或有阻碍以上运营和服务的行为；<br>
                        6）实施本协议第17条所述禁止行为的；<br>
                        7）本公司认为应当拒绝其会员注册申请或取消其会员资格的其他情况。<br>


                    </p>
                    <h3>第二条（帐号管理）</h3>
                    <p>
                        1. 会员在完成注册后，须负责管理其帐号和密码。使用会员帐号使用本服务的行为，即认为系会员本人进行的行为，会员对服务的使用承担一切责任。<br>
                        2. 会员不应将会员帐号出借、转让、买卖、抵押。<br>
                        3. 由于会员对帐号保管不当、不安全操作或使用而造成的一切损失，由会员自行承担，本公司不承担任何责任。<br>
                        4.
                        如会员发现其帐号遭他人非法盗用、使用或发生其他危及账户安全的情形，应立即书面通知本平台，要求暂停或终止相关服务，本平台将在合理时间内进行处理，但本公司对在采取行动前已经产生的后果（包括但不限于会员的任何损失）不承担任何责任。<br>
                        5. 本平台按照会员登录的联系方式发送有关的通知，并按常规到达的时间默认为送达。<br>

                    </p>
                    <h3>第三条（会员信息）</h3>
                    <p>
                        1. 本平台使用会员个人信息的目的 为了更好地提供服务。<br>
                        2. 本平台遵循隐私政策保护个人信息，不向第三方提供具有可识别性的个人信息。但在相关法律法规规定的情况下，可以提供个人信息。<br>
                        3. 会员在使用本服务时，本平台可以使用Cookie。<br>
                    </p>
                    <h3>第四条（停止会员资格）</h3>
                    <p>
                        本平台由于以下理由，可以在不通知或催告会员的情况下，暂时停止会员资格。<br>
                        1. 会员本人或指使他人不正当地使用会员帐号、密码及本服务时；<br>
                        2. 会员在规定的日期内未补交欠费时；<br>
                        3. 会员被执行没收、暂时没收、暂时处理、强制执行、破产、要求民事重整时，或会员自己提出请求时。<br>
                        4. 会员涉嫌妨害本平台的运营和服务或妨害其他会员使用本平台的服务，或有涉嫌阻碍以上运营和服务的行为<br>
                        5.本公司认为应当暂停其会员资格的其他情况。<br>
                    </p>
                    <h3>第五条（退款）</h3>
                    <p>
                        1. 会员可以按照本平台规定的手续办理账户余额退款。<br>
                        2. 会员将余额提出后，会员积累的特权等级和积分将予以保留，账户仍可正常登录和查看。 <br>
                    </p>
                    <h3>第六条 （欠费处理）</h3>
                    <p>
                        会员对接受本平台提供的服务需支付的费用形成欠费的，本公司可对以该会员名义交付、或以该会员为收件人的，处于本公司占有之下的任何物品行使留置权。
                        本公司将通过本平台向会员发出通知期为二个月的留置通知。如会员未在前述通知期内偿付欠费的，则通知期一旦届满，本公司即可开始留置财产的处置，
                        并无须另行通知会员。本公司不对由此导致的任何会员损失承担责任。本条所述留置担保的范围包括主债权（会员欠费）及利息、违约金、损害赔偿金、
                        留置物保管费用和实现留置权的费用。此权利的行使不影响本公司依据法律、法规的规定或合同、协议、规则的约定，对会员采取其他追索或补救措施。
                    </p>
                    <h2>三、服务约定</h2>
                    <h3>第七条（本服务的说明)</h3>
                    <p>
                        1. 由于本平台不参与会员与相关货物的卖方或买方之间的合同关系，因此本公司不成为买卖合同的当事人。本公司不承担一切与货物相关的瑕疵、侵害知识产权等责任，但会员有证据证明货物灭失或损坏发生在本公司掌管该货物期间的除外。<br>
                        2.
                        由于本公司系在会员的授权范围内以会员的名义与承运人订立运输合同，因此本公司不成为运输合同的当事人。由于运输事故或其他原因造成货物未送达、延误、破损、灭失及其他与运输有关的问题而导致会员遭受损失的，本公司将协助会员向承运人提出索赔。<br>
                        3. 本公司作为会员的货运代理人从事包括但不限于订舱/车、报关、报检、进仓、配送等货运代理行为。会员赋予本公司以会员的名义缔结运输合同的权限。<br>

                    </p>
                    <h3>第八条（本服务的价格和支付条件）</h3>
                    <p>
                        本服务费用如网站价格表所示。本平台可随时对价格表进行变更。会员应在每次交易前查阅当时有效的平台服务价格。计价依据的货物重量，以本平台的计量结果为准。
                    </p>
                    <h3>第九条（检查货物）</h3>
                    <p>
                        1. 本公司有权，但并无义务对货物进行开封检查，本公司对货物的检查仅以履行货运代理合同的便利为目的，无论是否开封检验，货物的品质和合法、合规性均由会员和货物的提供者负责，本公司对此不承担任何责任。<br>
                        2. 本公司如果发现有关货物存在违法可能时，本公司有权通知执法部门，并根据执法部门的命令对货物进行处置。<br>
                    </p>
                    <h2>四、责任范围和责任限制</h2>
                    <h3>第十条 （赔偿）</h3>
                    <p>
                        对于非购买保险的托运货物发生灭失、损毁、短少时，本公司按照本平台公布的理赔规则赔付（详见网站公告）；对于购买保险的托运货物发生灭失、毁损、短少时，本公司按照本平台公布的保险赔付规则赔付（详见网站公告）。本公司不承担任何间接、附带、特殊或衍生的损失（包括但不限于收入或利润损失、承担违约责任损失等）所产生的赔偿责任。
                    </p>
                    <h3>第十一条 （责任范围和责任限制）</h3>
                    <p>
                        本公司不会就下列原因造成的托运货物灭失、损毁、延迟送达、错误送达、未送达、提供错误资料或未能提供资料承担任何责任，亦不对因下述任一情况而导致会员的任何损害承担赔偿责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害(无论本平台是否已被告知该等损害赔偿的可能性)，亦不采取任何运费调整、退款或任何补偿行为：<br>
                        1. 因会员、托运货物所有人、承运人不履行责任或疏忽造成的；<br>
                        2. 因托运货物的本质或瑕疵、特性或固有缺陷造成的，如有明显破损等；<br>
                        3. 因会员违反本公司所签发的运单、本服务协议、平台服务指南、规则或其它协议等造成的，包括但不限于货物申报不实，寄运货件的包装、安全保障、标志；<br>
                        4.
                        因发生空难事故、公敌入侵、恐怖袭击、政府当局、法律权限、海关或检疫所官员的行为或疏忽、暴动、罢工或其它地区性争执、民众骚乱、战争或天气所带来的危险、或由非本公司所能控制事项所致的全国性或区域性空中、海上或地面交通系统中断或通讯系统干扰或故障。在此情况下，本公司仍会尽合理的努力，尽快将货物运送至目的地并完成送件。但我们没有义务在出现此类情况时向会员发出通知；<br>
                        5. 本公司遵循会员或其他寄、收件人的口头或书面送件指示行为造成的；<br>
                        6. 如果包裹在送达时无破损且基本完整、收件人未提出异议并发出书面破损记录，寄件人包装并封口的包裹内发生货物遗失或损毁；<br>
                        7. 因清关手续或其它主管机关规定手续所致的；<br>
                        8. 因会员没有及时确认关税及支付税金和其他应付费用所致的；<br>
                        9. 磁带、文件或其它存储媒体中数据的消除、或曝光底片中照相影像或音带的消除；<br>
                        10. 易碎品的破损及损坏，包括但不限于玻璃陶瓷材料及其制品、乐器、电子设备元件、照相器材、光学器材等，但会员已要求加固增值服务后依然导致破损及损害情况除外；<br>
                        11. 发件人或者购物网站未能提供能够支持多次转运需要的包装而造成的毁损；<br>
                        12. 会员或发件人提供错误、不完整、不清晰或遗漏的地址或收件人信息，且无法联系收件人，造成的重复配送所产生的费用及相关的后果；<br>
                        13. 会员指定的收货人拒收货物造成的；<br>
                        14. 第三方未经批准的使用会员的账户或更改会员的数据；<br>
                        15. 会员对本平台服务的误解；<br>
                        16. 因本平台信息网络正常的设备维护，信息网络连接故障，电脑、通讯或其他系统的故障，电力故障而造成的不能服务或延迟服务；<br>
                        17. 任何非因本平台的原因而引起的与本平台服务有关的其它损失。<br>
                    </p>
                    <h3>第十二条 （索赔）</h3>
                    <p>
                        对于托运货物或部分托运货物损毁、灭失（包括延误引起的货物腐烂或损坏）的索赔，寄件人必须在托运货物送达后 30 天或自托运货物交付本公司起60天内向本司提出索赔申请,
                        理赔申请文件应包含理赔申请表，托运货物在本平台系统内注册的申报价格。对于未能送件或错误送件的索赔，涉及海运或铁路运输的，寄件人应自托运货物交付本公司起60天内向本公司提出申请；其余不涉及海运或铁路运输的，寄件人应自托运货物交付本公司起30天内向本司提出索赔申请,
                        理赔申请文件应包含理赔申请表，托运货物在本平台系统内注册的申报价格。
                        在任何情况下，寄件人在超出上述索赔期限后提出的索赔申请将不被本公司受理。
                    </p>
                    <h2>五、禁止使用本服务的货物</h2>
                    <h3>第十三条 （禁止使用本服务的货物）</h3>
                    <p>
                        以下物品不能使用本服务：<br>
                        1. 现金及支票、汇票、证券以及其他有价证券类；<br>
                        2. 信用卡、现金卡等卡类；<br>
                        3. 金融机关的存折以及现金提款卡；<br>
                        4. 包裹上的送达地不易识别为本平台商号，也没有其他文字记载；<br>
                        5. 活的动植物、死的动物或剥制的动物（即标本）；<br>
                        6. 人体或人体的一部分、遗体、遗骨、牌位；<br>
                        7. 兴奋剂、大麻、麻药、作用于中枢神经影响精神状态的药物以及其他违禁药物；<br>
                        8. 枪炮、刀剑、武器、兵器、火药类、爆炸物、有毒物、有毒化学物品；<br>
                        9. 医药品、医疗器械、易碎品；<br>
                        10. 儿童色情画、成人色情录像带以及其他淫秽物品；<br>
                        11. 其运送、进出口受包括经由国在内的进出口国、州、地方自治体的法令禁止或限制的物品；<br>
                        12. 航空、运输公司的运输协议中不允许承运的其他物品；<br>
                        13. 任何形式的侵犯知识产权的货物；<br>
                        14. 本平台认为不符合规定的其他物品。<br>
                    </p>
                    <h3>第十四条（拒绝提供本服务）</h3>
                    <p>
                        如发生或可能发生以下情况，即使本公司已经承接了相关业务，本公司也有权单方面中止提供本服务，并无须向会员承担任何违约或赔偿责任：<br>
                        1. 会员托运的货物属于第十三条规定的货物时；<br>
                        2. 本公司不能确认会员的所在地或货物发送目的地的地址时；<br>
                        3. 会员或会员指定的收货人拒绝接收货物时；<br>
                        4. 本公司委托的运输公司不进行货物的运输时；<br>
                        5. 会员托运的货物被海关扣留时；<br>
                        6. 会员违反本协议的约定时；<br>
                        7. 本平台认为有必要停止服务的其他情况。<br>
                    </p>
                    <h3>第十五条（不能转运货物的处理）</h3>
                    <p>
                        1. 本公司收到第十三条、第十四条规定的货物时，可以拒收、要求交货人或会员自行提回、移交执法部门或以其他方法处置。<br>
                        2. 对于本公司按本条规定或法律规定处置相关货物所可能导致的会员损失，本公司将不承担任何责任。<br>
                    </p>
                    <h3>第十六条（反侵犯知识产权货物条款）</h3>
                    <p>
                        本公司一旦发现会员利用本公司服务进行针对侵权货物的仓储、运输、销售等活动的，本公司将立即停止为会员提供所有服务，且本公司将按照当地法律规定配合执法部门调查，并提供执法部门所需要的客户及货物的相关信息。由此导致的一切损失和法律责任均应由会员承担。
                    </p>
                    <h2>六、禁止行为</h2>
                    <h3>第十七条 （禁止行为）</h3>
                    <p>
                        会员在使用本服务中，不得实施以下任何一项的行为。<br>
                        1.违反国家法律、法规等规范性文件或本平台各项规则的规定和要求，违背社会公共利益或公共道德，损害他人的合法权益，偷逃应缴税费，违反本协议及相关规则。<br>
                        2. 在交易过程中，违反遵守诚实信用原则，采取不正当竞争行为，扰乱网上交易的正常秩序，从事与网上交易无关的行为。；<br>
                        3. 侵害本平台以及第三方的商标权、著作权、外观专利权、发明专利权等知识产权以及肖像权、广告宣传权以及其他权利；<br>
                        4.不对本平台上的任何数据作商业性利用，包括但不限于在未经本公司事先书面同意的情况下，以复制、传播等任何方式使用本平台站上展示的资料。<br>
                        5.冒充第三方使用本服务的行为；<br>
                        6. 使用任何装置、软件或例行程序干预或试图干预本平台的正常运作或正在本平台上进行的任何交易、活动。您不得采取任何将导致不合理的庞大数据负载加诸本平台网络设备的行动。；<br>
                        7.其他本平台认为需要禁止的行为。<br>
                        由于会员违反上述约定，导致本平台或本公司遭受任何损失的，本公司有权要求会员赔偿所有直接和间接损失。<br>
                    </p>
                    <h2>七、服务终止</h2>
                    <h3>第十八条（服务终止） </h3>
                    <p>
                        本平台有权自行全权决定以任何理由或无理由不经事先通知的中止、终止向您提供部分或全部本平台服务，暂时冻结或永久冻结（注销）您的账户在本平台的权限，且无须为此向您或任何第三方承担任何责任。
                    </p>
                    <h2>八、其他</h2>
                    <h3>第十九条（适用法律和管辖）</h3>
                    <p>
                        1.本协议的执行、解释及争议的解决均应适用中华人民共和国法律，如无相关法律规定的，则应参照通用国际商业惯例和/或行业惯例；<br>
                        2.凡因本服务协议引起的或与本服务协议有关的任何争议，双方应尽量友好协商解决；均应提交上海仲裁委员会按照该会仲裁规则进行仲裁。仲裁裁决是终局的，对双方当事人均有约束力。
                    </p>
                    <h3>第二十条（非弃权和可分性）</h3>
                    <p>
                        本公司未行使或执行本服务协议任何权利或规定，不构成对前述权利或权利之放弃。如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍有效并且有约束力。
                    </p>
                    <h3>第二十一条（特别提示）</h3>
                    <p>
                        本公司在此特别提醒用户认真阅读本协议中的粗体、斜体字条款， 包括免除或限制本平台和本公司责任的免责条款及对会员的权利限制。
                    </p>
                    <h3> 《隐私政策》</h3>
                    <p>
                        天珅（上海）电子商务有限公司（Seedeer全球跨境物流平台）（以下简称“本平台”）制定隐私政策如下。本平台的隐私声明正在不断改进中，随着平台服务范围的扩大，我们会随时更新我们的隐私声明。为使您能放心使用本平台的各项服务，本平台将严格遵守有关保护个人信息的法令法规。
                        1.个人信息的定义<br>
                        在本隐私政策中记述的“个人信息”指在本平台所保管的会员号码、姓名、性别、邮件地址、电话、地址、身份证号码等信息中，通过其中的一个或几个信息的组合即能识别特定个人的信息。<br>
                        2.使用用途<br>
                        本平台使用个人信息用于以下用途。<br>
                        ①.会员管理；<br>
                        ②.销售或提供本平台或第三方的商品、权利、数字内容、物流服务（以下统称为“商品”）；<br>
                        ③.进行推销活动和有奖企划、问卷调查；<br>
                        ④.使用本平台及子网站所提供的必须进行会员注册的服务时，简化会员注册手续；<br>
                        ⑤.通知在网站服务运营中的必要事项、如提货清关、转运派送等。（包括发送电子邮件、手机短信）；<br>
                        ⑥.用于本平台及第三方的商品的广告、宣传以及推销（包括发送电子邮件、手机短信）；<br>
                        ⑦.提供积分、优惠券等服务（以下称“积分等”）；<br>
                        ⑧.处理各种查询及售后服务；<br>
                        ⑨.进行市场数据的调查分析及开发新的服务项目。<br>
                        3.提供个人信息<br>
                        本平台规范保护个人信息，除了个人信息保护法以及其他法令等规定的情况外，未经同意，不得向第三方披露或提供具有可识别性的个人的信息。<br>
                        4.安全保护<br>
                        为保护向本平台提供的个人信息，防止第三方的不法入侵，我们采用了行业标准的MD5密码方式。本平台对于必要的个人信息，将通过MD5密码化通信方式进行保护，确保其安全性。另外按照本平台规定的管理标准严格管理个人信息，采取设置防火墙、配备杀毒软件等各种策略，以防止因病毒感染等所造成的个人信息的遗失、破坏、篡改、泄露。<br>
                        5. Cookie的使用<br>
                        cookies是少量的数据，在您未拒绝接受cookies的情况下，cookies将被发送到您的浏览器，并储存在您的计算机硬盘。我们使用cookies储存您访问我们网站的相关数据，在您访问或再次访问我们的网站时，我们能识别您的身份，并通过分析数据为您提供更好更多的服务。
                        您有权选择接受或拒绝接受cookies。您可以通过修改浏览器的设置以拒绝接受cookies，但是我们需要提醒您，因为您拒绝接受cookies，您可能无法使用依赖于cookies的我们网站的部分功能。<br>
                        6.外部链接<br>
                        本平台含有到其他网站的链接。天珅（上海）电子商务有限公司（Seedeer全球跨境物流平台）对那些网站的隐私保护措施不负任何责任。我们可能在任何需要的时候增加商业伙伴或共用品牌的网站。
                        <br>
                        7.个人信息的公开、修改、删除<br>
                        本平台按照个人信息保护法和其他法令法规进行对个人信息的相关处理。<br>
                        8.有关隐私保护政策的更新<br>
                        本平台为适应法令法规的变更或按照需要将改订隐私保护政策，以保护个人信息，改订后，我们将登载最新的隐私政策。<br>
                        9.联系我们<br>
                        如果您对本隐私政策或天珅（上海）电子商务有限公司（Seedeer全球跨境物流平台）的隐私保护措施以及您在使用中的问题有任何意见和建议，请和我们联系：<br>
                        E-mail：Sales@seedeer.com
                    </p>
                    <h3>《提交条款》</h3>
                    <p>
                        本人：指使用天珅（上海）电子商务有限公司（Seedeer）所提供的全球跨境物流平台（以下简称“Seedeer全球跨境物流平台”）进行提交运单操作或配送指令，将货物转寄或配送到目的地国家或地区的客户、收件人，或指同天珅（上海）电子商务有限公司（Seedeer）签订服务协议的合同方。<br>
                        本人声明，本人委托天珅（上海）电子商务有限公司作为本人的货运代理人。天珅（上海）电子商务有限公司在本人授权范围内从事的包括但不限于订舱/车、报关、报检、进仓、配送等货运代理行为（如有），法律后果均由本人享有和承担。<br>
                        1.本人保证<br>
                        委托Seedeer全球跨境物流平台运输的货物，没有有关法律禁止或限制出运的货物，包括但不限于海关总署令第43号令——《中华人民共和国禁止/限制进出口境物品表》中所列的任何禁运物品或超出规定的限运物品，以及IATA组织规定的禁止运输物品，所有货物不属于目的地国家或地区禁止和限制进出境物品，所有货物非IPR-Violating货物即货物无侵犯任何知识产权行为。一旦在运输过程中发现此类物品，Seedeer全球跨境物流平台有权将货物扣留或移送相关部门，并不再提供后续服务，因此产生的额外费用由本人承担。
                        所提交运单单票重量符合物流公司为保证运输安全对包装所设定的限制。本人保证承担因超出运输安全限重或合理限量造成货物查验、征税、退运期间产生的破损、丢失、罚没等后果，并承担因此产生的一切直接或间接的经济和法律责任。
                        本人保证提供准确、有效的收件人地址信息，如地址错误导致货物无法送达收件人，将承担因此产生的一切风险和费用。<br>
                        2.本人承诺<br>
                        所提交货物的申报信息完全属实。如因本人故意申报不实，有瞒报、谎报、虚报的行为（包括但不限于瞒报、谎报、虚报品名，如品名与实物不符、谎报货物数量、不规范品名等；谎报价值，指申报0价值或虚假的申报价值；谎报收件人信息，谎报虚假收件人和收件地址信息等），本人将承担由此产生的一切后果，包括但不限于海关惩罚性延迟清关，或高额逾期清关、退运、仓储费用，以及没收、追究相关法律责任等后果，并承担因此产生的一切直接或间接的经济和法律责任。
                        本人承诺已了解Seedeer全球跨境物流平台网站公示的相关规定所描述的国际运输风险，并同意天珅（上海）电子商务有限公司/Seedeer全球跨境物流平台在任何情况下都不承担任何间接损失（包括但不限于收入或利润损失）。<br>
                        3.本人声明<br>
                        本人声明如货物在海关查验如产生关税等，报清关费用，将由本人承担，并确认了解因拒付或拖延支付此类费用将造成Seedeer全球跨境物流平台停止提供后续服务的后果。
                        以上内容，本人已完全知晓并自愿接受所有条款。
                    </p>

                    <h3>《免责声明》</h3>
                    <p>
                        本公司不会就下列原因造成的托运货物遗失、损毁、延迟送达、误送、未送达、提供错误资料或未能提供资料承担任何责任，亦不对因下述任一情况而导致用户的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿，亦不采取任何运费调整、退款或任何补偿行为：<br>
                        1. 因用户、托运货物所有人、承运人不履行责任或疏忽造成的；<br>
                        2. 因托运货物的本质或瑕疵、特性或固有缺陷，如有明显破损等；<br>
                        3. 用户违反本公司所签发的运单、本条款、服务指南、或其它协议等，包括但不限于货物申报不实，寄运货件的包装、安全保障、标志或地址书写不当或不完整；<br>
                        4.
                        发生空难事故、公敌入侵、政府当局、法律权限、海关或检疫所官员的行为或疏忽、暴动、罢工或其它地区性争执、民众骚乱、战争或天气所带来的危险、或由非本公司所能控制事项所致的全国性或区域性空中或地面交通系统中断或通讯系统干扰或故障。在此情况下，本公司仍会尽合理的努力，尽快运送至目的地并完成送件。但我们没有义务在出现此类情况时向用户发出通知；<br>
                        5. 本公司遵循用户或其他寄、收件人的口头或书面送件指示行为导致；<br>
                        6. 如果包裹在送达时无破损且基本完整、收件人未提出异议并发出书面破损记录，寄件人包装并封口的包裹内发生遗失或损毁；<br>
                        7. 因清关手续或其它主管机关规定手续所致的延误；<br>
                        8. 因用户没有及时确认关税及税金支付所致的延误；<br>
                        9. 因用户在海关清关过程中申报价格过低、申报信息错误或其他原因导致的目的国产生的任何问题及行政机关处罚等；<br>
                        10. 因用户未按照目的国当地法律法规进行税务申报、税务登记等一系列法定手续，所致的一切后果及行政机关处罚等；<br>
                        11. 磁带、文件或其它存储媒体中数据的消除、或曝光底片中照相影像或音带地消除；<br>
                        12. 外包装完好，内件破损的包裹；<br>
                        13. 易碎品的破损及损坏，包括但不限于玻璃陶瓷材料及其制品，乐器，电子设备元件，照相器材等；除要求加固增值服务后依然导致破损及损害情况外；<br>
                        14. 发件人或者购物网站未能提供能够支持多次转运需要的包装而造成的毁损；<br>
                        15. 提供错误、不完整、不正确或遗漏的地址信息，无法联系收件人，造成的重复配送所产生的费用及相关的后果，我们将不承担责任；<br>
                        16. 货物入库超过180天未提交运单发货，天珅有权对货物做相关处理。<br>

                        本公司一旦发现客户利用本平台进行对侵权商品的仓储、运输、销售等活动，将立即停止为该客户名下侵权产品提供仓储及配送服务，本平台不负责由此对客户产生的任何经济损失，由此产生的费用由客户承担。同时，本平台将按照当地法律规定配合执法部门调查，提供执法部门所需要的客户及商品的相关信息。
                    </p>
                </div>
                <span slot="footer" class="dialog-footer">
                    <el-button @click="ProtoclCancel()">取 消</el-button>
                    <el-button type="primary" @click="ProtoclSuccess()">确 定</el-button>
                </span>
            </el-dialog>
        </div>
    </div>
</template>

<script>
    import http from '../../axios/http';
    import { Loading } from 'element-ui';
    import ElImage from "../../../node_modules/element-ui/packages/image/src/main";

    export default {
        components: {ElImage},
        name: 'register',
        data() {
            return {
                logining: false,
                ruleForm2: {
                    userName: '',
                    email:'',
                    protocol: false
                },
                centerDialogVisible: false,
                myTime:0,
                rules2: {
                    userName: [
                        { required: true, message: '请输入账号', trigger: 'blur' },
                        //{ validator: validaePass }
                    ],
                    passWord: [
                        { required: true, message: '请输入密码', trigger: 'blur' },
                        //{ validator: validaePass2 }
                    ],
                    email:[
                        { required: true, message: '请输入邮箱', trigger: 'blur' },
                    ]
                },
                checked: true
            };
        },
        methods: {
            goLogin(){
                this.$router.push('login');
            },
            goRegister(){
                this.$router.push('register');
            },
            //取消协议
            ProtoclCancel(){
                this.centerDialogVisible = false;
                this.ruleForm2.protocol=false;
            },
            //同意协议
            ProtoclSuccess(){
                this.centerDialogVisible = false;
                this.ruleForm2.protocol=true;
            },
            //注冊
            handleRegister() {
                if(!this.ruleForm2.protocol){
                    this.$message("请同意注册协议");
                    return;
                }
                console.log(this.$md5(this.ruleForm2.passWord));
                this.$refs.ruleForm2.validate((valid) => {
                    if (valid) {
                        this.logining = true;
                        var loginParams = {
                            userName: this.ruleForm2.userName,
                            passWord:this.$md5(this.ruleForm2.passWord),
                            email:this.ruleForm2.email,
                            mobile: this.ruleForm2.mobile,
                            vrifyCode:this.ruleForm2.vrifyCode
                        };
                        let url = "api/login/register";
                        let loginLoading = Loading.service({ fullscreen: true , text: '正在注冊中。。。。。'});
                        http.postOrPut(url, "post", loginParams).then(response => {
                            loginLoading.close();
                            if(response.code==='00000'){
                                this.$router.push('login');
                            }else{
                                this.$message(response.message);
                            }

                        }).catch(function (error) {
                            this.isLoading = true;
                            console.log(JSON.stringify(error));
                            this.$message.error(error['data']);
                        });
                    } else {
                        console.log('error submit!!');
                        return false;
                    }
                });
            },
        }
    }

</script>

<style lang="scss" scoped>
    .body{
        background: url('http://test-reg.seedeer.com/static/images/h_register_bg.jpg')  no-repeat;
        width: 100%;
        height:100%;
    }
    .login-container {
        /*box-shadow: 0 0px 8px 0 rgba(0, 0, 0, 0.06), 0 1px 0px 0 rgba(0, 0, 0, 0.02);*/
        -webkit-border-radius: 5px;
        border-radius: 5px;
        -moz-border-radius: 5px;
        background-clip: padding-box;
        margin: 180px auto;
        width: 350px;
        padding:  0 3%;
        background: #fff;
        border: 1px solid #eaeaea;
        box-shadow: 0 0 25px #cac6c6;
        .title {
            margin: 0px auto 40px auto;
            text-align: center;
            padding-top:20px;
            color: #505458;
        }
        .remember {
            margin: 0px 0px 15px 0px;
        }

    }
    .footer{
        position:absolute;
        left:0;
        bottom:0;
        width:100%;
        height:80px;
        text-align: center;
        color:#000;
        font-weight:bold;
        line-height: 20px;
    }
    .address{
        width: 100%;
        height: 40px;
        line-height: 40px;
        background: #043567;
    }
    .temp {
        width: 160px;
        float: left;
        margin-left: 0;
        text-align: center;
    }
    .temp .tempNum {
        font-size: 80px;
        color: #fff;
        float: none;
        height: 110px;
    }
    .temp span {
        font-size: 22px;
        color: #fff;
        float: none;
        cursor: pointer;
    }
    .temp .tempDu {
         position: relative;
         top: -84px;
         left: 100px;
     }
    .otherWeather {
        width: 109px;
        float: right;
        margin-top: 10px;
    }
    .weatherRow {
        width: 100%;
        text-align: left;
        font-size: 12px;
        height: 17px;
        display: none;
        cursor: pointer;
    }
</style>
